app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')
SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY "movies"."release_date" ASC
---
  def index
    @ratings_checked = {}
    @all_ratings = Movie.uniq.pluck(:rating)
    order = params[:order]

    if not params[:ratings]
      ratings = @all_ratings
      @all_ratings.each do |rating|
        @ratings_checked[rating] = 1
      end
    else
      ratings = params[:ratings].keys
      @ratings_checked = params[:ratings]
    end


    if order == 'title'
      @movies = Movie.order(:title)
      @title_class = 'hilite'
    elsif order == 'release_date'
      @movies = Movie.order(:release_date)
      @release_date_class = 'hilite'
    else
      @movies = Movie.find_all_by_rating(ratings)